cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'telemachus/brew', 'https://telemachus@bitbucket.org/telemachus/brew.git'
tap 'homebrew/core'

brew 'mas'
brew 'zsh'
brew 'autojump'
brew 'wget'
brew 'the_silver_searcher'
brew 'python'
brew 'vim'
brew 'macvim'
brew 'tmux'
brew 'htop-osx'
brew 'tig'
brew 'ruby-build'
brew 'rbenv'
brew 'python'
brew 'pipenv'
brew 'nmap'
brew 'reattach-to-user-namespace'
brew 'unrar'
brew 'hub'
brew 'neovim'
brew 'fzf'
brew 'awscli'
brew 'git-flow'
brew 'terraform'
brew 'terragrunt'
brew 'Schniz/tap/fnm'
brew 'todo-txt'

# CASKS (GUI APPS)

cask 'alfred'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'iterm2'
cask 'moom'
cask 'dash'
cask 'slack'
cask 'telegram-desktop'
cask 'spotify'
cask 'keybase'
cask 'ngrok'
cask 'coconutbattery'
cask 'skype'
cask 'vlc'
cask 'cyberduck'
cask 'postman'
cask 'sonos'
cask 'webtorrent'
cask 'visual-studio-code'
cask 'recordit'
cask 'font-fira-mono'
cask 'krisp'
cask 'gpg-suite'
cask 'notion'
cask 'docker'

# MAC APP STORE APPS
mas 'Airmail 3', id: 918858936
mas 'Keynote', id: 409183694
mas 'Pixelmator', id: 407963104
mas 'Skitch', id: 425955336
mas 'TweetDeck', id: 485812721
mas 'Twitter', id: 409789998
