cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'

brew 'mas'
brew 'zsh'
brew 'starship'
brew 'bat'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'neovim'
brew 'autojump'
brew 'fzf'
brew 'lazygit'
brew 'lazydocker'
brew 'wget'
brew 'the_silver_searcher'
brew 'ripgrep'
# brew 'yabai'
# brew 'skhd'
brew 'gh'
brew 'mise'
brew 'jq'

# CASKS (GUI APPS)

cask '1password'
cask 'aerospace'
cask 'font-jetbrains-mono-nerd-font'
cask 'alacritty'
cask 'raycast'
cask 'google-chrome'
cask 'google-chrome@canary'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'brave-browser'
cask 'slack'
cask 'zoom'
cask 'coconutbattery'
cask 'vlc'
cask 'webtorrent'
cask 'visual-studio-code'
cask 'docker'
cask 'signal'
cask 'calibre'
# cask 'lastfm'

# MAC APP STORE APPS
mas 'Pixelmator', id: 407963104
